In [8]:
import pandas as pd
import numpy as np
import random

In [14]:
diam_org = pd.read_csv(r'../zasoby/diamonds.csv', usecols=['color', 'price'])
diam = diam_org.copy()

In [4]:
diam.head()

  color  price
0     E    326
1     E    326
2     E    327
3     I    334
4     J    335

In [6]:
grouped_diam = diam.groupby('color')
grouped_diam.mean()

             price
color
D      3169.954096
E      3076.752475
F      3724.886397
G      3999.135671
H      4486.669196
I      5091.874954
J      5323.818020

In [7]:
mean_by_colors = grouped_diam.mean()

In [10]:
missing_data_ind = random.sample(range(0, len(diam)-1), 5)
missing_data_ind

[31984, 18999, 7708, 50727, 43793]

In [11]:
diam.iloc[missing_data_ind]

      color  price
31984     F    776
18999     J   7822
7708      E   4278
50727     H   2294
43793     D   1442

In [16]:
diam.iloc[missing_data_ind, 1] = np.NaN

In [17]:
diam.iloc[missing_data_ind]

      color  price
31984     F    NaN
18999     J    NaN
7708      E    NaN
50727     H    NaN
43793     D    NaN

In [18]:
mean_after_nan = diam.groupby('color').mean()
mean_by_colors - mean_after_nan

          price
color
D     -0.255086
E      0.122626
F     -0.309075
G      0.000000
H     -0.264082
I      0.000000
J      0.889983

In [21]:
filter_nan = diam['price'].isna()

In [22]:
diam[filter_nan]

      color  price
7708      E    NaN
18999     J    NaN
31984     F    NaN
43793     D    NaN
50727     H    NaN

In [23]:
diam.loc[filter_nan, 'color'].map(mean_after_nan['price'])

7708     3076.629849
18999    5322.928037
31984    3725.195472
43793    3170.209182
50727    4486.933277
Name: color, dtype: float64

In [24]:
diam.loc[filter_nan, 'price'] = diam.loc[filter_nan, 'color'].map(mean_after_nan['price'])

In [25]:
diam.iloc[missing_data_ind]

      color        price
31984     F  3725.195472
18999     J  5322.928037
7708      E  3076.629849
50727     H  4486.933277
43793     D  3170.209182

In [26]:
mean_repair = diam.groupby('color').mean()
mean_by_colors - mean_repair

          price
color
D     -0.255086
E      0.122626
F     -0.309075
G      0.000000
H     -0.264082
I      0.000000
J      0.889983

In [27]:
mean_after_nan - mean_repair

              price
color
D      4.547474e-13
E      4.547474e-13
F      0.000000e+00
G      0.000000e+00
H      0.000000e+00
I      0.000000e+00
J      0.000000e+00

In [28]:
diam2 = diam_org.copy()

In [30]:
diam2['price'].mean()

3932.799721913237

In [31]:
diam2.iloc[missing_data_ind, 1] = np.NaN

In [33]:
diam2.iloc[missing_data_ind]

      color  price
31984     F    NaN
18999     J    NaN
7708      E    NaN
50727     H    NaN
43793     D    NaN

In [34]:
diam2.fillna(value=diam2['price'].mean(), inplace=True)

In [35]:
diam2.iloc[missing_data_ind]

      color        price
31984     F  3932.856309
18999     J  3932.856309
7708      E  3932.856309
50727     H  3932.856309
43793     D  3932.856309

In [36]:
mean_repair_2 = diam2.groupby('color').mean()
mean_by_colors - mean_repair_2

          price
color
D     -0.367654
E      0.035230
F     -0.330838
G      0.000000
H     -0.197357
I      0.000000
J      1.385023

In [37]:
mean_after_nan - mean_repair_2

          price
color
D     -0.112568
E     -0.087397
F     -0.021763
G      0.000000
H      0.066724
I      0.000000
J      0.495040